*** Create emacs configuration file
To use the plugin installed before, you need to modify the first path to give the path where the plugin is installed (see section upper),
and a path to the Zig executable need also to be referenced.

After that, the following command ~C-c C-v t~ (~ctrl-c ctrl-v t~) will produce a ~zigIterativeProgramming.el~ file.
This file can be load from your emacs configuration (see section below).
#+begin_src emacs-lisp :tangle zigIterativeProgramming.el
  (setq base_dir "~/PATH-WHERE-THE-ZIG-PLUGIN-IS-INSTALLED/ob-zig.el")
  (setq org-babel-zig-compiler "PATH-TO-THE-ZIG-EXECUTABLE")
#+end_src

#+begin_src emacs-lisp :tangle zigIterativeProgramming.el
  (require 'package)
  (add-to-list 'package-archives
               '("melpa" . "https://melpa.org/packages/"))
  (package-initialize)
  (package-refresh-contents)
#+end_src

#+begin_src emacs-lisp :tangle zigIterativeProgramming.el
  (defun install-custom-pkg (pck)
    (if (featurep pck)
        (message "The package %s is already installed !" pck)
      (package-install pck)
      ))
#+end_src

#+begin_src emacs-lisp :tangle zigIterativeProgramming.el
  (install-custom-pkg 'zig-mode)
  (install-custom-pkg 'lsp-mode)
#+end_src

#+RESULTS:
: The package lsp-mode is already installed !

#+begin_src emacs-lisp :tangle zigIterativeProgramming.el
  (require 'lsp-mode)
  (add-hook 'zig-mode-hook #'lsp)
#+end_src

#+begin_src emacs-lisp :tangle zigIterativeProgramming.el
  (let ((local-file-path (expand-file-name "ob-zig.el" base_dir)))
    (setq org-babel-zig-compiler local-file-path)
    (load-file local-file-path)
  )
#+end_src

#+begin_src emacs-lisp :tangle zigIterativeProgramming.el
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(org-babel-load-languages '((C . t) (emacs-lisp . t) (shell . t))))
#+end_src

